added_item_name_text = {
    'uk': '''
🖋✨ Напишіть назву предмета, який ви хочете додати. Креативна та цікава назва допоможе вашому предмету виділитися серед інших і привернути більше уваги! 💼🌟🚀
    🔺 Якщо ви передумали, натисніть "🛑 Відмінити"..
    ''',
    'en': """
🖋✨ Please enter the name of the item you want to add. A creative and catchy title will make your item stand out and attract more attention! 💼🌟🚀
    🔺 If you've changed your mind, press "🛑 Cancel".
    """,
    'pl': '''
🖋✨ Wprowadź nazwę przedmiotu, który chcesz dodać. Kreatywna i ciekawa nazwa sprawi, że twój przedmiot wyróżni się na tle innych i przyciągnie więcej uwagi! 💼🌟🚀
    🔺 Jeśli zmieniłeś zdanie, naciśnij "🛑 Anuluj".
    ''',
    'ru': '''
🖋✨ Введите название предмета, который вы хотите добавить. Креативное и интересное название поможет вашему предмету выделиться среди других и привлечь больше внимания! 💼🌟🚀
    🔺 Если вы передумали, нажмите "🛑 Отменить".
    
    '''
}

cancel_added_item_text = {
    'uk': '''
✅ Ви вирішили не додавати предмет. Все гаразд!
    ''',
    'en': """
✅ You've decided not to add an item. That's okay!
    """,
    'pl': '''
✅ Zdecydowałeś się nie dodawać przedmiotu. Wszystko w porządku!
    ''',
    'ru': '''
✅ Вы решили не добавлять предмет. Все в порядке!
    '''
}

item_name_len_error_text = {
    'uk': '''
🚫📝 Ваша назва занадто довга! ✏️🛑 Будь ласка, введіть назву, яка містить не більше 24 символів, включаючи пробіли. 📏🔍
    ''',
    'en': """
🚫📝 Your title is too long! ✏️🛑 Please enter a title that is no more than 24 characters, including spaces. 📏🔍
    """,
    'pl': '''
🚫📝 Twój tytuł jest za długi! ✏️🛑 Wprowadź tytuł, który ma nie więcej niż 24 znaki, w tym spacje. 📏🔍
    ''',
    'ru': '''
🚫📝 Ваше название слишком длинное! ✏️🛑 Пожалуйста, введите название не длиннее 24 символов, включая пробелы. 📏🔍
    '''
}

added_item_media_text = {
    'uk': '''
📸 Будь ласка, додайте фотографію або коротке відео вашого предмета. Це допоможе іншим користувачам краще оцінити вашу пропозицію! 🎥
    ''',
    'en': """
📸 Please add a photo or a short video of your item. This helps other users better assess your offer! 🎥
    """,
    'pl': '''
📸 Proszę dodać zdjęcie lub krótki filmik przedmiotu. Pomaga to innym użytkownikom lepiej ocenić twoją ofertę! 🎥
    ''',
    'ru': '''
📸 Пожалуйста, добавьте фотографию или короткое видео вашего предмета. Это поможет другим пользователям лучше оценить ваше предложение! 🎥
    '''
}

added_item_description_text = {
    'uk': '''
📝 Додайте короткий опис до вашого предмета. Це допоможе іншим користувачам краще зрозуміти, що ви пропонуєте для обміну. Спробуйте бути ясним та конкретним. 🖋
    ''',
    'en': """
📝 Add a brief description for your item. It helps other users understand what you're offering for exchange. Try to be clear and specific. 🖋
    """,
    'pl': '''
📝 Dodaj krótki opis swojego przedmiotu. To pomoże innym użytkownikom lepiej zrozumieć, co oferujesz w zamian. Staraj się być jasny i konkretny. 🖋
    ''',
    'ru': '''
📝 Добавьте краткое описание вашего предмета. Это поможет другим пользователям лучше понять, что вы предлагаете на обмен. Старайтесь быть ясным и конкретным. 🖋
    '''
}

item_description_len_error_text = {
    'uk': '''
🚫 Ваш опис занадто довгий! Будь ласка, забезпечте опис довжиною не більше 200 символів, включаючи пробіли. Скоротіть та спробуйте ще раз. 📝
    ''',
    'en': """
🚫 Your description is too long! Please ensure it's no more than 200 characters, including spaces. Shorten it and try again. 📝
    """,
    'pl': '''
🚫 Twój opis jest zbyt długi! Upewnij się, że nie ma więcej niż 200 znaków, w tym spacji. Skróć go i spróbuj ponownie. 📝
    ''',
    'ru': '''
🚫 Ваше описание слишком длинное! Убедитесь, что оно не превышает 200 символов, включая пробелы. Укоротите и попробуйте снова. 📝
    '''
}