user_cabinet_menu_text = {
    'uk': '''
🔹🔹🔹 ВАШ ПРОФІЛЬ 🔹🔹🔹

👤 ID: {}
🏙 Місто: {}
🌍 Мова: {}
⭐️ Рейтинг: {}

✧･ﾟ: *✧･ﾟ:*──────:*:･ﾟ✧*:･ﾟ✧
    ''',
    'en': '''
🔹🔹🔹 YOUR PROFILE 🔹🔹🔹

👤 ID: {}
🏙 City: {}
🌍 Language: {}
⭐️ Rating: {}

✧･ﾟ: *✧･ﾟ:*──────:*:･ﾟ✧*:･ﾟ✧
    ''',
    'pl': '''
🔹🔹🔹 TWÓJ PROFIL 🔹🔹🔹

👤 ID: {}
🏙 Miasto: {}
🌍 Język: {}
⭐️ Ocena: {}

✧･ﾟ: *✧･ﾟ:*──────:*:･ﾟ✧*:･ﾟ✧
    ''',
    'ru': '''
🔹🔹🔹 ВАШ ПРОФИЛЬ 🔹🔹🔹

👤 ID: {}
🏙 Город: {}
🌍 Язык: {}
⭐️ Рейтинг: {}

✧･ﾟ: *✧･ﾟ:*──────:*:･ﾟ✧*:･ﾟ✧
    '''
}

user_language_text = {
    'uk': '🇺🇦 Українська',
    'en': '🇬🇧 English',
    'pl': '🇵🇱 Polski',
    'ru': '🐷 Кацапський'
}

successful_language_change_text = {
    'uk': '🌐 Мова успішно змінена на українську! 🔄',
    'en': '🌐 Language successfully changed to English! 🔄',
    'pl': '🌐 Język został pomyślnie zmieniony na polski! 🔄',
    'ru': '🌐 Язык изменён на Кацапский 💩'
}

successful_city_change_text = {
    'uk': '🌆 Ваше місто успішно змінено на {}! 🔄',
    'en': '🌆 Your city has been successfully changed to {}! 🔄',
    'pl': '🌆 Twoje miasto zostało pomyślnie zmienione na {}! 🔄',
    'ru': '🌆 Ваш город успешно изменен на {}! 🔄'
}

change_city_user_cabinet_text = {
    'uk': '🌍 Будь ласка, введіть назву вашого міста або натисніть на кнопку, щоб надати геолокацію. 🌍',
    'en': '🌍 Please enter the name of your city or press the button to provide geolocation. 🌍',
    'pl': '🌍 Wprowadź nazwę swojego miasta lub naciśnij przycisk, aby podać geolokalizację. 🌍',
    'ru': '🌍 Пожалуйста, введите название вашего города или нажмите на кнопку, чтобы предоставить геолокацию. 🌍'
}

help_user_cabinet_text = {
    'uk': '''
🔧 Технічна підтримка BarterBot 🔧

Якщо у вас виникли проблеми з роботою бота або є інші питання, будь ласка, пишіть у Telegram: {}

Ми завжди готові вам допомогти!
    ''',
    'en': """
🔧 Technical Support for BarterBot 🔧

If you encounter any issues with the bot or have other inquiries, please reach out on Telegram: {}

We're always here to assist!
    """,
    'pl': '''
🔧 Pomoc techniczna dla BarterBot 🔧

Jeśli masz problemy z działaniem bota lub inne pytania, napisz do nas na Telegramie: {}

Zawsze jesteśmy gotowi pomóc!
    ''',
    'ru': '''
🔧 Техническая поддержка BarterBot 🔧

Если у вас возникли проблемы с работой бота или есть другие вопросы, пожалуйста, пишите в Telegram: {}

Мы всегда готовы помочь!
    '''
}