added_item_name_text = {
    'uk': '''
🖋✨ Напишіть назву предмета, який ви хочете додати. Креативна та цікава назва допоможе вашому предмету виділитися серед інших і привернути більше уваги! 💼🌟🚀
    🔺 Якщо ви передумали, натисніть "🛑 Відмінити"..
    ''',
    'en': """
🖋✨ Please enter the name of the item you want to add. A creative and catchy title will make your item stand out and attract more attention! 💼🌟🚀
    🔺 If you've changed your mind, press "🛑 Cancel".
    """,
    'pl': '''
🖋✨ Wprowadź nazwę przedmiotu, który chcesz dodać. Kreatywna i ciekawa nazwa sprawi, że twój przedmiot wyróżni się na tle innych i przyciągnie więcej uwagi! 💼🌟🚀
    🔺 Jeśli zmieniłeś zdanie, naciśnij "🛑 Anuluj".
    ''',
    'ru': '''
🖋✨ Введите название предмета, который вы хотите добавить. Креативное и интересное название поможет вашему предмету выделиться среди других и привлечь больше внимания! 💼🌟🚀
    🔺 Если вы передумали, нажмите "🛑 Отменить".
    
    '''
}

cancel_added_item_text = {
    'uk': '''
✅ Ви вирішили не додавати предмет. Все гаразд!
    ''',
    'en': """
✅ You've decided not to add an item. That's okay!
    """,
    'pl': '''
✅ Zdecydowałeś się nie dodawać przedmiotu. Wszystko w porządku!
    ''',
    'ru': '''
✅ Вы решили не добавлять предмет. Все в порядке!
    '''
}

item_name_len_error_text = {
    'uk': '''
🚫📝 Ваша назва занадто довга! ✏️🛑 Будь ласка, введіть назву, яка містить не більше 24 символів, включаючи пробіли. 📏🔍
    ''',
    'en': """
🚫📝 Your title is too long! ✏️🛑 Please enter a title that is no more than 24 characters, including spaces. 📏🔍
    """,
    'pl': '''
🚫📝 Twój tytuł jest za długi! ✏️🛑 Wprowadź tytuł, który ma nie więcej niż 24 znaki, w tym spacje. 📏🔍
    ''',
    'ru': '''
🚫📝 Ваше название слишком длинное! ✏️🛑 Пожалуйста, введите название не длиннее 24 символов, включая пробелы. 📏🔍
    '''
}

added_item_media_text = {
    'uk': '''
📸 Будь ласка, додайте фотографію або коротке відео вашого предмета (не більше 3 медіафайлів). Це допоможе іншим користувачам краще оцінити вашу пропозицію! 🎥
    ''',
'en': """
📸 Please add a photo or a short video of your item (up to 3 media files). This helps other users better assess your offer! 🎥
    """,
'pl': '''
📸 Proszę dodać zdjęcie lub krótki filmik przedmiotu (maksymalnie 3 pliki multimedialne). Pomaga to innym użytkownikom lepiej ocenić twoją ofertę! 🎥
    ''',
'ru': '''
📸 Пожалуйста, добавьте фотографию или короткое видео вашего предмета (не более 3 медиафайлов). Это поможет другим пользователям лучше оценить ваше предложение! 🎥
    '''
}

added_item_description_text = {
    'uk': '''
📝 Додайте короткий опис до вашого предмета. Це допоможе іншим користувачам краще зрозуміти, що ви пропонуєте для обміну. Спробуйте бути ясним та конкретним. 🖋
    ''',
    'en': """
📝 Add a brief description for your item. It helps other users understand what you're offering for exchange. Try to be clear and specific. 🖋
    """,
    'pl': '''
📝 Dodaj krótki opis swojego przedmiotu. To pomoże innym użytkownikom lepiej zrozumieć, co oferujesz w zamian. Staraj się być jasny i konkretny. 🖋
    ''',
    'ru': '''
📝 Добавьте краткое описание вашего предмета. Это поможет другим пользователям лучше понять, что вы предлагаете на обмен. Старайтесь быть ясным и конкретным. 🖋
    '''
}

item_description_len_error_text = {
    'uk': '''
🚫 Ваш опис занадто довгий! Будь ласка, забезпечте опис довжиною не більше 200 символів, включаючи пробіли. Скоротіть та спробуйте ще раз. 📝
    ''',
    'en': """
🚫 Your description is too long! Please ensure it's no more than 200 characters, including spaces. Shorten it and try again. 📝
    """,
    'pl': '''
🚫 Twój opis jest zbyt długi! Upewnij się, że nie ma więcej niż 200 znaków, w tym spacji. Skróć go i spróbuj ponownie. 📝
    ''',
    'ru': '''
🚫 Ваше описание слишком длинное! Убедитесь, что оно не превышает 200 символов, включая пробелы. Укоротите и попробуйте снова. 📝
    '''
}

max_media_sent_text = {
    'uk': '🎈 Упс! Занадто багато медіа! Зупинімося на трьох. 📸🎥',
    'en': "🎈 Oops! Too much media! Let's stick to three. 📸🎥",
    'pl': '🎈 Ups! Za dużo multimediów! Zatrzymajmy się na trzech. 📸🎥',
    'ru': '🎈 Упс! Слишком много медиа! Остановимся на трех. 📸🎥'
}

invalid_media_type_text = {
    'uk': '''
🙈 Упс! Це ж не фото чи відео! Може, знову спробуємо? 📸🎥
    ''',
    'en': """
🙈 Oops! That's not a photo or video! Shall we try again? 📸🎥
    """,
    'pl': '''
🙈 Ups! To przecież nie zdjęcie ani film! Może spróbujmy ponownie? 📸🎥
    ''',
    'ru': '''
🙈 Ой! Это же не фото или видео! Попробуем еще раз? 📸🎥
    '''
}

media_count_msg_text = {
    'uk': '🎈 Додано {} з 3 медіафайлів.',
    'en': '🎈 Added {} out of 3 media files.',
    'pl': '🎈 Dodano {} z 3 plików multimedialnych.',
    'ru': '🎈 Добавлено {} из 3 медиафайлов.'
}

input_media_video_duration_error_text = {
    'uk': "🎥 Ваше відео занадто довге! 😅 Будь ласка, відправте відео, що триває не більше 15 секунд. ⏳",
    'en': "🎥 Your video is too long! 😅 Please send a video that's no longer than 15 seconds. ⏳",
    'pl': "🎥 Twoje wideo jest zbyt długie! 😅 Proszę wysłać film, który trwa nie dłużej niż 15 sekund. ⏳",
    'ru': "🎥 Ваше видео слишком длинное! 😅 Пожалуйста, отправьте видео, продолжительностью не более 15 секунд. ⏳"
}

quantity_item_media_text = {
    'uk': '🎉 Завантажено {} медіафайлів! 📸',
    'en': '🎉 Loaded {} media files! 📸',
    'pl': '🎉 Załadowano {} plików multimedialnych! 📸',
    'ru': '🎉 Загружено {} медиафайлов! 📸'
}

media_is_not_loaded_text = {
    'uk': '🤔 Ви ще не завантажили жодного медіафайлу. 🚫📸',
    'en': '🤔 You haven\'t loaded any media files yet. 🚫📸',
    'pl': '🤔 Jeszcze nie załadowałeś żadnych plików multimedialnych. 🚫📸',
    'ru': '🤔 Вы еще не загрузили ни одного медиафайла. 🚫📸'
}

clear_media_text = {
    'uk': '🔄 Медіафайли успішно очищені! Тепер ви можете завантажити їх знову. 📸🎥',
    'en': '🔄 Media files have been cleared! You can now upload them again. 📸🎥',
    'pl': '🔄 Pliki multimedialne zostały wyczyszczone! Możesz teraz przesłać je ponownie. 📸🎥',
    'ru': '🔄 Медиафайлы успешно очищены! Теперь вы можете загрузить их снова. 📸🎥'
}